
#### Terraform Plan
<details>
<summary>Expand</summary>

```
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/timovink/shared-infrastructure/runs/run-VFEy2LFJjfF3D7jZ

Waiting for the plan to start...

Terraform v1.9.3
on linux_amd64
Initializing plugins and modules...
module.global_certificate["jackievink.ca"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/b52c04e4-2275-4af0-b511-2b7856ae0c2a]
module.global_certificate["jackievink.com"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/5e9a13c7-7566-4015-8d4d-c7348b28bdfa]
module.global_certificate["timovink.ca"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/c14c4e0f-400b-415b-bdf9-f5b38995b474]
module.global_certificate["timovink.com"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/b5424589-49e4-41be-aed5-4e0387f5e995]
module.global_certificate["timovink.app"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/ed6e0edc-3d1a-41fd-900a-9342fcb09642]
module.global_certificate["timovink.dev"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/c37f96fe-c8d6-4cfa-a752-9b95610577d1]
module.global_certificate["timovink.me"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/7f64e0e2-6db5-4238-84c2-f6e6cb4d3784]
module.local_certificate["jackievink.ca"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/305d17f7-06bd-4225-ad9a-e87bdc55bb1c]
module.budget.aws_budgets_budget.monthly: Refreshing state... [id=920122847127:terraform-20220612005833117900000001]
module.local_certificate["timovink.com"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/565cc509-937d-40c1-af1b-6bda6b20b0ba]
module.iam.aws_iam_group.administrators: Refreshing state... [id=administrators]
module.local_certificate["timovink.dev"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/d39882fd-6bbc-4a45-9b11-5c7641acdc78]
module.vpc.data.aws_availability_zones.this: Refreshing...
module.local_certificate["timovink.me"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/bb69bfd2-7436-4a06-8724-357dc2ac6a31]
module.local_certificate["jackievink.com"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/5f674d32-d423-4d1d-be66-2e422a7d686b]
module.local_certificate["timovink.app"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/5f1891ea-f40c-4a9d-ab9e-348e1c3bd261]
module.local_certificate["timovink.ca"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/f2448255-1554-46f8-9986-db1dc7b961d3]
module.iam.aws_iam_user.admin["tvink"]: Refreshing state... [id=tvink]
module.iam.aws_iam_user.admin["deployer"]: Refreshing state... [id=deployer]
module.domain_redirects["jackievink.com"].aws_cloudfront_function.redirect: Refreshing state... [id=redirect-to-jackievinkcom]
module.vpc.data.aws_availability_zones.this: Refresh complete after 0s [id=us-west-2]
module.domain_redirects["timovink.dev"].aws_cloudfront_function.redirect: Refreshing state... [id=redirect-to-timovinkdev]
module.dns["timovink.ca"].aws_route53_zone.this: Refreshing state... [id=Z08658091IB2VPYFZRTIS]
module.dns["timovink.me"].aws_route53_zone.this: Refreshing state... [id=Z03760682G96A69XLHYRC]
module.dns["timovink.dev"].aws_route53_zone.this: Refreshing state... [id=Z09071302Y5GD83DY6NXW]
module.dns["timovink.com"].aws_route53_zone.this: Refreshing state... [id=ZFMCDCUJ8UCFO]
module.dns["jackievink.ca"].aws_route53_zone.this: Refreshing state... [id=Z072293219D14M35KH4SZ]
module.dns["jackievink.com"].aws_route53_zone.this: Refreshing state... [id=Z0213673ODBY64GY09TO]
module.dns["timovink.app"].aws_route53_zone.this: Refreshing state... [id=Z090672659X2JIXVUFX0]
module.iam.aws_iam_group_policy_attachment.administrators: Refreshing state... [id=administrators-20220605021751233100000001]
module.iam.aws_iam_user_group_membership.admin["tvink"]: Refreshing state... [id=terraform-20220605021751235700000002]
module.iam.aws_iam_user_group_membership.admin["deployer"]: Refreshing state... [id=terraform-20220604232226591200000002]
module.global_certificate["timovink.com"].aws_route53_record.validation["timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.global_certificate["timovink.com"].aws_route53_record.validation["*.timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.global_certificate["jackievink.ca"].aws_route53_record.validation["jackievink.ca"]: Refreshing state... [id=Z072293219D14M35KH4SZ__937652936d27f2d693c725eb2355f79f.jackievink.ca._CNAME]
module.global_certificate["timovink.ca"].aws_route53_record.validation["timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.global_certificate["timovink.app"].aws_route53_record.validation["timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.global_certificate["timovink.dev"].aws_route53_record.validation["timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.global_certificate["timovink.me"].aws_route53_record.validation["*.timovink.me"]: Refreshing state... [id=Z03760682G96A69XLHYRC__d981f155ba389684d19abaf617b78217.timovink.me._CNAME]
module.global_certificate["jackievink.com"].aws_route53_record.validation["*.jackievink.com"]: Refreshing state... [id=Z0213673ODBY64GY09TO__456a894c8fe28e49ad6211de6dc5bc82.jackievink.com._CNAME]
module.global_certificate["jackievink.com"].aws_route53_record.validation["jackievink.com"]: Refreshing state... [id=Z0213673ODBY64GY09TO__456a894c8fe28e49ad6211de6dc5bc82.jackievink.com._CNAME]
module.global_certificate["timovink.ca"].aws_route53_record.validation["*.timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.global_certificate["timovink.app"].aws_route53_record.validation["*.timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.global_certificate["jackievink.ca"].aws_route53_record.validation["*.jackievink.ca"]: Refreshing state... [id=Z072293219D14M35KH4SZ__937652936d27f2d693c725eb2355f79f.jackievink.ca._CNAME]
module.global_certificate["timovink.me"].aws_route53_record.validation["timovink.me"]: Refreshing state... [id=Z03760682G96A69XLHYRC__d981f155ba389684d19abaf617b78217.timovink.me._CNAME]
module.global_certificate["timovink.dev"].aws_route53_record.validation["*.timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.local_certificate["timovink.me"].aws_route53_record.validation["*.timovink.me"]: Refreshing state... [id=Z03760682G96A69XLHYRC__d981f155ba389684d19abaf617b78217.timovink.me._CNAME]
module.local_certificate["timovink.app"].aws_route53_record.validation["*.timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.local_certificate["timovink.ca"].aws_route53_record.validation["*.timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.local_certificate["timovink.com"].aws_route53_record.validation["timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.local_certificate["timovink.ca"].aws_route53_record.validation["timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.local_certificate["jackievink.ca"].aws_route53_record.validation["jackievink.ca"]: Refreshing state... [id=Z072293219D14M35KH4SZ__937652936d27f2d693c725eb2355f79f.jackievink.ca._CNAME]
module.local_certificate["timovink.me"].aws_route53_record.validation["timovink.me"]: Refreshing state... [id=Z03760682G96A69XLHYRC__d981f155ba389684d19abaf617b78217.timovink.me._CNAME]
module.local_certificate["timovink.app"].aws_route53_record.validation["timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.local_certificate["jackievink.ca"].aws_route53_record.validation["*.jackievink.ca"]: Refreshing state... [id=Z072293219D14M35KH4SZ__937652936d27f2d693c725eb2355f79f.jackievink.ca._CNAME]
module.local_certificate["jackievink.com"].aws_route53_record.validation["*.jackievink.com"]: Refreshing state... [id=Z0213673ODBY64GY09TO__456a894c8fe28e49ad6211de6dc5bc82.jackievink.com._CNAME]
module.local_certificate["timovink.com"].aws_route53_record.validation["*.timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.local_certificate["timovink.dev"].aws_route53_record.validation["timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.local_certificate["timovink.dev"].aws_route53_record.validation["*.timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.local_certificate["jackievink.com"].aws_route53_record.validation["jackievink.com"]: Refreshing state... [id=Z0213673ODBY64GY09TO__456a894c8fe28e49ad6211de6dc5bc82.jackievink.com._CNAME]
module.global_certificate["timovink.me"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["jackievink.ca"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["jackievink.com"].aws_acm_certificate_validation.this: Refreshing state... [id=2023-09-01 21:05:52.447 +0000 UTC]
module.global_certificate["timovink.app"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["timovink.dev"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["timovink.com"].aws_acm_certificate_validation.this: Refreshing state... [id=2022-06-05 03:29:25.278 +0000 UTC]
module.global_certificate["timovink.ca"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["timovink.app"].aws_acm_certificate_validation.this: Refreshing state... [id=2023-09-01 21:05:40.307 +0000 UTC]
module.local_certificate["jackievink.com"].aws_acm_certificate_validation.this: Refreshing state... [id=2023-09-01 21:05:46.205 +0000 UTC]
module.local_certificate["timovink.ca"].aws_acm_certificate_validation.this: Refreshing state... [id=2023-09-01 21:05:32.951 +0000 UTC]
module.local_certificate["timovink.com"].aws_acm_certificate_validation.this: Refreshing state... [id=2023-09-01 21:06:11.246 +0000 UTC]
module.local_certificate["timovink.dev"].aws_acm_certificate_validation.this: Refreshing state... [id=2023-09-01 21:05:36.685 +0000 UTC]
module.local_certificate["timovink.me"].aws_acm_certificate_validation.this: Refreshing state... [id=2023-09-01 21:05:34.801 +0000 UTC]
module.local_certificate["jackievink.ca"].aws_acm_certificate_validation.this: Refreshing state... [id=2023-09-01 21:06:03.438 +0000 UTC]
module.domain_redirects["jackievink.com"].aws_cloudfront_distribution.this["jackievink.ca"]: Refreshing state... [id=EWZR221LI6SAB]
module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.me"]: Refreshing state... [id=E2GZRPVZ7VHNJP]
module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.app"]: Refreshing state... [id=EAY5X8SBN5IQF]
module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.com"]: Refreshing state... [id=E2D3O6B3HCBCCK]
module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.ca"]: Refreshing state... [id=E3PHIQXJMETTPU]
module.domain_redirects["timovink.dev"].aws_route53_record.this["timovink.me"]: Refreshing state... [id=Z03760682G96A69XLHYRC_timovink.me_A]
module.domain_redirects["timovink.dev"].aws_route53_record.this["timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO_timovink.com_A]
module.domain_redirects["jackievink.com"].aws_route53_record.this["jackievink.ca"]: Refreshing state... [id=Z072293219D14M35KH4SZ_jackievink.ca_A]
module.domain_redirects["timovink.dev"].aws_route53_record.this["timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS_timovink.ca_A]
module.domain_redirects["timovink.dev"].aws_route53_record.this["timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0_timovink.app_A]
module.local_certificate["timovink.com"].aws_acm_certificate.this: Drift detected (update)
module.local_certificate["timovink.me"].aws_acm_certificate.this: Drift detected (update)
module.global_certificate["timovink.ca"].aws_acm_certificate.this: Drift detected (update)
module.global_certificate["timovink.com"].aws_acm_certificate.this: Drift detected (update)
module.local_certificate["timovink.ca"].aws_acm_certificate.this: Drift detected (update)
module.local_certificate["timovink.app"].aws_acm_certificate.this: Drift detected (update)
module.global_certificate["timovink.me"].aws_acm_certificate.this: Drift detected (update)
module.local_certificate["jackievink.com"].aws_acm_certificate.this: Drift detected (update)
module.local_certificate["jackievink.ca"].aws_acm_certificate.this: Drift detected (update)
module.local_certificate["timovink.dev"].aws_acm_certificate.this: Drift detected (update)
module.global_certificate["timovink.dev"].aws_acm_certificate.this: Drift detected (update)
module.global_certificate["jackievink.ca"].aws_acm_certificate.this: Drift detected (update)
module.global_certificate["jackievink.com"].aws_acm_certificate.this: Drift detected (update)
module.global_certificate["timovink.app"].aws_acm_certificate.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = {
          + "Project" = "shared-infrastructure"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags_all         = {
          + "Project" = "shared-infrastructure"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_a will be created
  + resource "aws_route_table_association" "public_a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_b will be created
  + resource "aws_route_table_association" "public_b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_c will be created
  + resource "aws_route_table_association" "public_c" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.public_a will be created
  + resource "aws_subnet" "public_a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = {
          + "Project" = "shared-infrastructure"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_b will be created
  + resource "aws_subnet" "public_b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = {
          + "Project" = "shared-infrastructure"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_c will be created
  + resource "aws_subnet" "public_c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = {
          + "Project" = "shared-infrastructure"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = {
          + "Project" = "shared-infrastructure"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>